<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<!--
MIT License

Copyright (c) 2013-2017 Nick McSpadden
Modifications copyright 2017 IT Services University Basel

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
-->

<dict>


    <!-- Profile Payload Content -->
	<key>PayloadContent</key>
	<array>

        <!-- airplay settings -->
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.airplay</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>showInMenuBarIfPresent</key>
								<{{ macos_profile__menuextras_Airplay_showInMenuBarIfPresent }}/>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>

            <!-- Payload Information -->
			<key>PayloadDescription</key>
			<string></string>
			<key>PayloadDisplayName</key>
			<string>Settings for airplay</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>FBFD806E-8CC8-4272-837B-C1CC2F48FE74</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>FE543EC3-99AE-4BA7-B1EB-57BF91ECD61A</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>

        <!-- Menu Extras -->
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.mcxMenuExtras</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>Airport.menu</key>
								<{{ macos_profile__menuextras_airport }}/>
								<key>Battery.menu</key>
								<{{ macos_profile__menuextras_battery }}/>
								<key>Bluetooth.menu</key>
								<{{ macos_profile__menuextras_bluetooth }}/>
								<key>Clock.menu</key>
								<{{ macos_profile__menuextras_clock }}/>
								<key>Display.menu</key>
								<{{ macos_profile__menuextras_display }}/>
								<key>RemoteDesktop.menu</key>
								<{{ macos_profile__menuextras_remotedesktop }}/>
								<key>TimeMachine.menu</key>
								<{{ macos_profile__menuextras_timemachine }}/>
								<key>User.menu</key>
								<{{ macos_profile__menuextras_user }}/>
								<key>VPN.menu</key>
								<{{ macos_profile__menuextras_vpn }}/>
								<key>delaySeconds</key>
								<real>2</real>
							</dict>
						</dict>
					</array>
					<key>mcx_targets</key>
					<array>
							<string>user</string>
					</array>
				</dict>
			</dict>

            <!-- Payload Information -->
			<key>PayloadDescription</key>
			<string></string>
			<key>PayloadDisplayName</key>
			<string>Settings for MenuExtras</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>1588D714-581D-4F93-97DF-3505178FCE98</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>984B982C-B582-4AC0-8DE4-20FF74714D2D</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>


    <!-- Profile Description -->
	<key>PayloadDescription</key>
	<string>{{ macos_profile__menuextras_PayloadDescription }}</string>
	<key>PayloadDisplayName</key>
	<string>{{ macos_profile__menuextras_PayloadDisplayName }}</string>
	<key>PayloadUUID</key>
	<string>1F01ADF9-18E2-4B6F-8C37-AAEE7783E64B</string>


    <!-- Organisation Information (Identical for every Profile) -->
	<key>PayloadEnabled</key>
	<true/>
	<key>PayloadIdentifier</key>
    <string>{{ macos_profile__profile }}</string>
	<key>PayloadOrganization</key>
	<string>{{ macos_profile__PayloadOrganization }}</string>
	<key>PayloadRemovalDisallowed</key>
	<{{ macos_profile__PayloadRemovalDisallowed }}/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadVersion</key>
	<integer>1</integer>


</dict>
</plist>
